Repository: Nicgott99/Drishti-Ai-App
Catalog: lib/l10n/app_*.arb
Languages: bn

# appName
source: Drishti AI
bn: দৃষ্টি এআই

# uploadButton
source: Upload X-Ray
bn: এক্স-রে আপলোড করুন

# captureButton
source: Capture X-Ray
bn: ছবি তুলুন

# resultTitle
source: Analysis Result
bn: বিশ্লেষণ ফলাফল

# analysisInProgress
source: Analyzing X-Ray with AI...
bn: এআই দিয়ে এক্স-রে বিশ্লেষণ চলছে...

source: Probability
bn: সম্ভাবনা

source: Risk Level
bn: ঝুঁকির মাত্রা

source: Confidence
bn: আত্মবিশ্বাস

source: Show Heatmap
bn: হিটম্যাপ দেখুন

source: Hide Heatmap
bn: হিটম্যাপ লুকান

source: Save Report
bn: রিপোর্ট সংরক্ষণ করুন

# reportSaved
source: Report saved successfully
bn: রিপোর্ট সফলভাবে সংরক্ষিত হয়েছে

# riskHigh
source: High
bn: উচ্চ

# riskMedium
source: Medium
bn: মাঝারি

# riskLow
source: Low
bn: নিম্ন

# errorTitle
source: Error
bn: ত্রুটি

# errorPickingImage
source: Failed to pick image
bn: ছবি নির্বাচন ব্যর্থ হয়েছে

# welcome
source: Welcome to Drishti AI
bn: দৃষ্টি এআই-তে স্বাগতম

# subtitle
source: AI-Powered TB Screening
bn: এআই চালিত টিবি স্ক্রিনিং

# selectImage
source: Select an X-Ray image to begin analysis
bn: বিশ্লেষণ শুরু করতে একটি এক্স-রে ছবি নির্বাচন করুন

source: TB Probability
bn: টিবি সম্ভাবনা

source: Back to Home
bn: হোমে ফিরুন

source: Report saved at
bn: রিপোর্ট সংরক্ষিত হয়েছে

source: No image selected
bn: কোন ছবি নির্বাচন করা হয়নি

source: Permission denied
bn: অনুমতি প্রত্যাখ্যান করা হয়েছে

# invalidXRay
source: Invalid X-Ray Image
bn: অবৈধ এক্স-রে ছবি

# notXRayImage
source: This doesn't appear to be an X-ray image. Please upload a chest X-ray.
bn: এটি একটি এক্স-রে ছবি বলে মনে হচ্ছে না। অনুগ্রহ করে একটি বুকের এক্স-রে আপলোড করুন।

source: Validating image...
bn: ছবি যাচাই করা হচ্ছে...

# uploadXRayOnly
source: Please upload X-ray images only
bn: শুধুমাত্র এক্স-রে ছবি আপলোড করুন

# chatbotTitle
source: TB Health Assistant
bn: টিবি স্বাস্থ্য সহায়ক

# chatbotSubtitle
source: Ask me anything about TB or this screening
bn: টিবি বা এই স্ক্রীনিং সম্পর্কে আমাকে যেকোনো কিছু জিজ্ঞাসা করুন

# chatPlaceholder
source: Ask about TB symptoms, prevention, treatment...
bn: টিবি লক্ষণ, প্রতিরোধ, চিকিৎসা সম্পর্কে জিজ্ঞাসা করুন...

# aiDisclaimer
source: AI Assistant - For informational purposes only. Consult healthcare professionals for medical advice.
bn: এআই সহায়ক - শুধুমাত্র তথ্যের জন্য। চিকিৎসা পরামর্শের জন্য স্বাস্থ্যসেবা পেশাদারদের সাথে পরামর্শ করুন।

source: Patient Registration
bn: রোগীর নিবন্ধন

# enterPatientInformation
source: Please enter patient information
bn: অনুগ্রহ করে রোগীর তথ্য লিখুন

source: Patient Name
bn: রোগীর নাম

source: Enter full name
bn: সম্পূর্ণ নাম লিখুন

# pleaseEnterName
source: Please enter patient name
bn: অনুগ্রহ করে রোগীর নাম লিখুন

source: Age
bn: বয়স

source: Invalid age
bn: অবৈধ বয়স

source: Required
bn: প্রয়োজনীয়

source: Gender
bn: লিঙ্গ

source: Male
bn: পুরুষ

source: Female
bn: মহিলা

source: Other
bn: অন্যান্য

source: Phone Number
bn: ফোন নম্বর

# pleaseEnterPhone
source: Please enter phone number
bn: অনুগ্রহ করে ফোন নম্বর লিখুন

# patientInfoNote
source: Patient information is kept confidential and used only for medical records
bn: রোগীর তথ্য গোপনীয় রাখা হয় এবং শুধুমাত্র চিকিৎসা রেকর্ডের জন্য ব্যবহৃত হয়

source: Continue to Scanning
bn: স্ক্যানিং চালিয়ে যান

source: Select Scan Method
bn: স্ক্যান পদ্ধতি নির্বাচন করুন

source: Capture X-Ray
bn: এক্স-রে ক্যাপচার করুন

source: Use device camera
bn: ডিভাইস ক্যামেরা ব্যবহার করুন

source: Upload X-Ray
bn: এক্স-রে আপলোড করুন

source: Select from gallery
bn: গ্যালারি থেকে নির্বাচন করুন

source: Analysis Results
bn: বিশ্লেষণ ফলাফল

source: X-Ray Analysis
bn: এক্স-রে বিশ্লেষণ

# withGradCAM
source: With AI Heatmap (Grad-CAM)
bn: এআই হিটম্যাপ সহ (Grad-CAM)

source: Original Image
bn: মূল ছবি

source: TB Suggestive
bn: টিবি সন্দেহজনক

source: No TB Detected
bn: টিবি সনাক্ত হয়নি

# referralRequired
source: Referral to specialist required
bn: বিশেষজ্ঞের কাছে রেফারেল প্রয়োজন

# normalResult
source: No signs of tuberculosis detected
bn: যক্ষ্মার কোন লক্ষণ পাওয়া যায়নি

source: Recommendations
bn: সুপারিশ

# recommendation1
source: • Refer patient for sputum microscopy test
bn: • থুতু মাইক্রোস্কোপি পরীক্ষার জন্য রোগীকে রেফার করুন

# recommendation2
source: • Schedule follow-up within 48 hours
bn: • ৪৮ ঘন্টার মধ্যে ফলো-আপ শিডিউল করুন

# recommendation3
source: • Monitor patient symptoms closely
bn: • রোগীর লক্ষণগুলি ঘনিষ্ঠভাবে পর্যবেক্ষণ করুন

# normalRecommendation1
source: • Continue routine health monitoring
bn: • নিয়মিত স্বাস্থ্য পর্যবেক্ষণ চালিয়ে যান

# normalRecommendation2
source: • Maintain healthy lifestyle practices
bn: • সুস্থ জীবনযাত্রার অভ্যাস বজায় রাখুন

# returnHome
source: Return to Home
bn: হোমে ফিরুন

source: Share Report
bn: রিপোর্ট শেয়ার করুন

source: Save Options
bn: সংরক্ষণের বিকল্প

source: Save to Device
bn: ডিভাইসে সংরক্ষণ করুন

source: Print Report
bn: রিপোর্ট প্রিন্ট করুন

source: Email Report
bn: ইমেইল রিপোর্ট
